## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 10 to add, 18 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_api_gateway_deployment.api must be replaced
+/- resource "aws_api_gateway_deployment" "api" {
      ~ created_date      = "2021-11-17T15:41:35Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:ca-central-1:806545929748:zjyu1t6h7e/" -> (known after apply)
      ~ id                = "ng3sjr" -> (known after apply)
      ~ invoke_url        = "https://zjyu1t6h7e.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ stage_description = "62c88dca92d2f1c13640063440992746" -> "c3fe628273a28cbff117f04d8216af03" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_rest_api.api will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "api" {
        id                           = "zjyu1t6h7e"
        name                         = "api-gateway"
      ~ tags                         = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
      ~ tags_all                     = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.api will be updated in-place
  ~ resource "aws_api_gateway_stage" "api" {
      ~ deployment_id         = "ng3sjr" -> (known after apply)
        id                    = "ags-zjyu1t6h7e-v1"
      ~ tags                  = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      ~ tags_all              = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_apigatewayv2_api.api_wskt will be created
  + resource "aws_apigatewayv2_api" "api_wskt" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + description                  = "Proxy to handle websocket requests to our API"
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "api-gatewayv2-websocket"
      + protocol_type                = "WEBSOCKET"
      + route_selection_expression   = "$request.body.action"
      + tags                         = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all                     = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # aws_apigatewayv2_integration.api_wskt_integ will be created
  + resource "aws_apigatewayv2_integration" "api_wskt_integ" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:806545929748:function:api/invocations"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.api_wskt_route_connect will be created
  + resource "aws_apigatewayv2_route" "api_wskt_route_connect" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$connect"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.api_wskt_route_default will be created
  + resource "aws_apigatewayv2_route" "api_wskt_route_default" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$default"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.api_wskt_route_disconnect will be created
  + resource "aws_apigatewayv2_route" "api_wskt_route_disconnect" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$disconnect"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.api_wskt_stage will be created
  + resource "aws_apigatewayv2_stage" "api_wskt_stage" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags          = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all      = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = "$context.identity.sourceIp [$context.requestTime] \"$context.httpMethod $context.path $context.protocol\" $context.status $context.responseLength $context.requestId"
        }

      + default_route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = false
          + logging_level            = (known after apply)
          + throttling_burst_limit   = 10
          + throttling_rate_limit    = 1
        }
    }

  # aws_cloudwatch_log_group.api_access will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "api_access" {
        id                = "/aws/api-gateway/api-access"
        name              = "/aws/api-gateway/api-access"
      ~ tags              = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
      ~ tags_all          = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.api_waf will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "api_waf" {
        id                = "/aws/kinesisfirehose/api_waf"
        name              = "/aws/kinesisfirehose/api_waf"
      ~ tags              = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
      ~ tags_all          = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.api_wskt_access will be created
  + resource "aws_cloudwatch_log_group" "api_wskt_access" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/api-gatewayv2/api-wskt-access"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # aws_ecr_repository.api will be updated in-place
  ~ resource "aws_ecr_repository" "api" {
        id                   = "scan-files/api"
        name                 = "scan-files/api"
      ~ tags                 = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
      ~ tags_all             = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_iam_policy.api will be updated in-place
  ~ resource "aws_iam_policy" "api" {
        id        = "arn:aws:iam::806545929748:policy/scan-files-api"
        name      = "scan-files-api"
      ~ tags      = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
      ~ tags_all  = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.write_waf_logs will be updated in-place
  ~ resource "aws_iam_policy" "write_waf_logs" {
        id          = "arn:aws:iam::806545929748:policy/scan-files_WriteLogs"
        name        = "scan-files_WriteLogs"
      ~ tags        = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
      ~ tags_all    = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_role.api will be updated in-place
  ~ resource "aws_iam_role" "api" {
        id                    = "scan-files-api"
        name                  = "scan-files-api"
      ~ tags                  = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
      ~ tags_all              = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.api_cloudwatch will be updated in-place
  ~ resource "aws_iam_role" "api_cloudwatch" {
        id                    = "ApiGatewayCloudWatchRole"
        name                  = "ApiGatewayCloudWatchRole"
      ~ tags                  = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
      ~ tags_all              = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.waf_log_role will be updated in-place
  ~ resource "aws_iam_role" "waf_log_role" {
        id                    = "scan-files-logs"
        name                  = "scan-files-logs"
      ~ tags                  = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
      ~ tags_all              = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_kinesis_firehose_delivery_stream.api_waf will be updated in-place
  ~ resource "aws_kinesis_firehose_delivery_stream" "api_waf" {
        id             = "arn:aws:firehose:ca-central-1:806545929748:deliverystream/aws-waf-logs-scan-files"
        name           = "aws-waf-logs-scan-files"
      ~ tags           = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
      ~ tags_all       = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_kms_key.scan-files will be updated in-place
  ~ resource "aws_kms_key" "scan-files" {
        id                                 = "c71bf0dd-721d-4f36-be85-5bea7927ad43"
      ~ tags                               = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
      ~ tags_all                           = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # aws_lambda_permission.apigatewayv2 will be created
  + resource "aws_lambda_permission" "apigatewayv2" {
      + action        = "lambda:InvokeFunction"
      + function_name = "api"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowAPIGatewayV2Invoke"
    }

  # aws_security_group.api will be updated in-place
  ~ resource "aws_security_group" "api" {
        id                     = "sg-0845d9714e0c52b00"
        name                   = "scan-files_api_sg"
      ~ tags                   = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
            # (1 unchanged element hidden)
        }
      ~ tags_all               = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_wafv2_web_acl.api_waf will be updated in-place
  ~ resource "aws_wafv2_web_acl" "api_waf" {
        id          = "ca5274a3-f27b-4562-a21e-5cd0c8c17835"
        name        = "api_waf"
      ~ tags        = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
      ~ tags_all    = {
          - "CostCenter" = "scan-files-production" -> null
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)



        # (8 unchanged blocks hidden)
    }

  # module.api.aws_lambda_permission.api_gateway[0] must be replaced
-/+ resource "aws_lambda_permission" "api_gateway" {
      ~ id            = "AllowAPIGatewayInvoke" -> (known after apply)
      ~ source_arn    = "arn:aws:apigateway:ca-central-1::/restapis/zjyu1t6h7e" -> "arn:aws:execute-api:ca-central-1:806545929748:zjyu1t6h7e/*/*" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.vpc.data.aws_iam_policy_document.vpc_metrics_flow_logs_write[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "vpc_metrics_flow_logs_write"  {
      ~ id      = "2102763991" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:806545929748:log-group:scan-files_flow_logs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:806545929748:log-group:scan-files_flow_logs",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.vpc.aws_cloudwatch_log_group.flow_logs[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "flow_logs" {
        id                = "scan-files_flow_logs"
        name              = "scan-files_flow_logs"
      ~ tags              = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      ~ tags_all          = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_flow_log.flow_logs[0] will be updated in-place
  ~ resource "aws_flow_log" "flow_logs" {
        id                       = "fl-0ed19996e32602de1"
      ~ tags                     = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      ~ tags_all                 = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_iam_policy.vpc_metrics_flow_logs_write_policy[0] will be updated in-place
  ~ resource "aws_iam_policy" "vpc_metrics_flow_logs_write_policy" {
        id          = "arn:aws:iam::806545929748:policy/VpcMetricsFlowLogsWrite"
        name        = "VpcMetricsFlowLogsWrite"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:806545929748:log-group:scan-files_flow_logs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:806545929748:log-group:scan-files_flow_logs",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags        = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      ~ tags_all    = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_iam_role.flow_logs[0] will be updated in-place
  ~ resource "aws_iam_role" "flow_logs" {
        id                    = "scan-files_flow_logs"
        name                  = "scan-files_flow_logs"
      ~ tags                  = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      ~ tags_all              = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 10 to add, 18 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

9 tests, 9 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
